load-test.yml
config:
  target: "http://riches-reach-alb-1199497064.us-east-1.elb.amazonaws.com"
  phases:
    - duration: 60
      arrivalRate: 10  # Start gentle
      rampTo: 100      # Ramp to 100 RPS
    - duration: 180
      arrivalRate: 100 # Steady at 100 RPS
      rampTo: 1000     # Burst to 1k RPS
  engines:
    http:
      http2: true  # Use HTTP/2 for efficiency

scenarios:
  - name: "Warm-up Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - json:
                ok: true
                mode: "full"

  - name: "GraphQL Stock Query"
    weight: 70  # 70% of traffic
    flow:
      - post:
          url: "/graphql"
          headers:
            Content-Type: "application/json"
          json:
            query: |
              {
                stocks(limit: 5) {
                  symbol
                  name
                  price
                }
              }
          expect:
            - statusCode: 200
            - json:
                data:
                  stocks: []  # Non-empty array

  - name: "GraphQL Beginner Friendly Query"
    weight: 10
    flow:
      - post:
          url: "/graphql"
          headers:
            Content-Type: "application/json"
          json:
            query: |
              {
                beginnerFriendlyStocks(limit: 3) {
                  symbol
                  name
                  price
                }
              }
          expect:
            - statusCode: 200